---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Transparency
source: html/417445e0-0fb3-3a01-3332-657f66d4cb27.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Transparency Property

Transparency percentage of diagram color fill

## Syntax (C#)
```csharp
public int Transparency { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: transparency is less than 0 or greater than 100